In [1]:
import pandas as pd
import mysql.connector as sql

In [2]:
import json

In [11]:
with open('code/example.json') as f:
    data = json.load(f)

In [12]:
data

{'glossary': {'title': 'example glossary',
  'GlossDiv': {'title': 'S',
   'GlossList': {'GlossEntry': {'ID': 'SGML',
     'SortAs': 'SGML',
     'GlossTerm': 'Standard Generalized Markup Language',
     'Acronym': 'SGML',
     'Abbrev': 'ISO 8879:1986',
     'GlossDef': {'para': 'A meta-markup language, used to create markup languages such as DocBook.',
      'GlossSeeAlso': ['GML', 'XML']},
     'GlossSee': 'markup'}}}}}

In [16]:
df = pd.read_html('https://finance.yahoo.com/quote/BABA/history?p=BABA')[0]

In [17]:
df.head()

           Date    Open    High     Low  Close*  Adj Close**      Volume
0  Aug 19, 2019  177.43  178.80  175.59  178.28       178.28  15533983.0
1  Aug 16, 2019  170.00  177.55  164.36  174.60       174.60  25365500.0
2  Aug 15, 2019  170.11  171.00  164.36  166.97       166.97  34899100.0
3  Aug 14, 2019  161.34  163.00  159.21  162.06       162.06  20803700.0
4  Aug 13, 2019  160.64  167.36  159.57  164.03       164.03  22842900.0

In [18]:
baba = pd.read_html('https://finance.yahoo.com/quote/BABA/history?period1=1411099200&period2=1566187200&interval=1wk&filter=history&frequency=1wk')[0]

In [19]:
baba.head()

           Date    Open    High     Low  Close*  Adj Close**       Volume
0  Aug 12, 2019  157.50  177.55  155.54  174.60       174.60  118335600.0
1  Aug 05, 2019  155.03  162.30  151.85  159.12       159.12  102988300.0
2  Jul 29, 2019  178.43  179.88  160.35  161.00       161.00  103892700.0
3  Jul 22, 2019  173.50  179.40  171.44  178.74       178.74   83635500.0
4  Jul 15, 2019  171.50  176.22  170.42  172.99       172.99   85530700.0

In [20]:
baba.tail()

,Date,Open,High,Low,Close*,Adj Close**,Volume
96,"Oct 09, 2017",178.97,184.70,177.97,178.45,178.45,73736200.0
97,"Oct 02, 2017",174.57,180.00,172.57,179.20,179.20,61343200.0
98,"Sep 25, 2017",176.48,177.00,166.79,172.71,172.71,104532900.0
99,"Sep 18, 2017",178.89,180.87,175.30,178.14,178.14,80396900.0
100,*Close price adjusted for splits.**Adjusted cl...,NaN,NaN,NaN,NaN,NaN,NaN

In [21]:
baba.shape

(101, 7)

In [23]:
1411099200 + ((86400 * 7)*100)

1471579200